Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/types_of_leave_from_work.html.txt.tmx
Source language: en
Languages: ga

source: Other types of leave from work
ga: Saoire eile ó fhostaíocht

source: There are many types of leave or time off work to which you may be entitled
ga: Is iomaí cineál saoire agus am saor ó obair a d'fhéadfá a bheidh i dteideal a fháil

source: These include annual leave, public holidays, sick leave, maternity leave, paternity leave, adoptive leave, carer’s leave and parental leave
ga: Ina measc siúd tá saoire bhliaintúil, saoirí poiblí, saoire bhreoiteachta, saoire mháithreachais, saoire atharthachta, saoire uchtaíoch, saoire chúramóra agus saoire thuismitheora

source: There are also times when you may require leave or time off work for specific reasons
ga: Bíonn amanna eile ann a d'fhéadfadh saoire ó obair a bheith uait ar fáthanna éagsúla

source: This could be when you have a family crisis, when you are called for jury service or if you wish to take study leave or a career break
ga: D'fhéadfadh géarchéim a bheith ann i do theaghlach, nó d'fheadfaí glaoch ort le freastal ar ghiúiré, nó b'fhéidir gur mhian leat saoire a bheith agat le staidéar a dhéanamh nó sos gairme a bheith agat

source: In some cases you are entitled to paid leave but in others you are not
ga: Uaireanta bíonn tú i dteideal saoire le pá a bheith agat agus uaireanta eile ní bhíonn

source: If you have a family crisis the Parental Leave Acts 1998 and 2006 give an employee a limited right to leave from work
ga: Tugann na hAchtanna um Shaoire do Thuismitheoirí 1998 agus 2006 ceart teoranta d'fhostaithe maidir le saoire ó obair má bhíonn géarchéim theaghlaigh ann

source: This is known as force majeure leave
ga: Tugtar saoire force majeure ar an tsaoire seo

source: It arises where, for urgent family reasons, the immediate presence of the employee is indispensable owing to an injury or illness of a close family member
ga: Tarlaíonn sé nuair caithfidh an fostaí a bheith sa bhaile, de bharr cúiseanna práinneacha teaghlaigh, de thoradh gortaithe nó breoiteachta a tharla do ghaol gairid teaghlaigh

source: Force majeure leave does not give any entitlement to leave following the death of a close family member
ga: Ba chóir a thabhairt faoi deara nach bhfuil aon teidlíocht maidir le saoire force majeure tar éis bháis duine den teaghlach

source: A close family member is defined as one of the following:
ga: Is é seo an sainmhíniú a thugtar ar ghaol gairid teaghlaigh:

source: • A child or adopted child of the employee
ga: • Páiste nó páiste uchtaithe de chuid an fhostaí

source: • The husband, wife or partner of the employee
ga: • Fear céile, bean chéile nó páirtí an fhostaí

source: • Parent or grandparent of the employee
ga: • Tuismitheoir nó seantuismitheoir de chuid an fhostaí

source: • Brother or sister of the employee
ga: • Deartháir nó deirfiúr de chuid an fhostaí

source: • Person to whom the employee has a duty of care (that is, he/she is acting in loco parentis)
ga: • Duine a mbíonn dualgas cúraim ag an bhfostaí ina leith (.i. tá sé nó sí ag feidhmiú in loco parentis ina leith)

source: • A person in a relationship of domestic dependency with the employee
ga: • Cleithiúnaí teaghlaigh a bhfuil caidreamh aige nó aici leis an bhfostaí

source: • Persons of any other class (if any) as may be prescribed
ga: • Duine d'aon rangú eile (más ann dóibh) de réir mar a leagfar síos

source: The maximum amount of leave is 3 days in any 12-month period or 5 days in a 36-month period
ga: Is í an uastréimhse saoire ná 3 lá in aon tréimhse 12 mí nó 5 lá i dtréimhse 36 mí

source: You are entitled to be paid while you are on force majeure leave - see 'How to apply' below for more details
ga: Tá tú i dteideal íocaíocht a fháil agus tú ar saoire force majeure. Féach ar 'Conas iarratas a dhéanamh' thíos le breis sonraí a fháil

source: Your employer may grant you further leave
ga: Féadfaidh d'fhostóir saoire bhreise a thabhairt duit

source: You are protected against unfair dismissal for taking force majeure leave or proposing to take it
ga: Tá cosaint agat ó dífhostú éagórach má thógann tú saoire force majeure nó má tá sé ar intinn agat í a bheith agat

source: If a member of your close family dies you have no entitlement to force majeure leave
ga: Níl tú i dteideal saoire force majeure a fháil má fhaigheann duine de do ghartheaghlach bás

source: Other compassionate leave not covered by force majeure leave will depend on your employment contract, custom and practice within your workplace or the employer's discretion
ga: Beidh saoire atruach eile nach bhfuil clúdaithe faoi shaoire force majeure ag brath ar an gconradh fostaíochta atá agat, agus ar nósanna agus ar chleachtais laistigh de d'ionad oibre, nó ar dhiscréid d'fhostóra

source: There is a range of bereavement counselling and support services available
ga: Tá réimse seirbhísí comhairleoireachta do lucht méala mar aon le seirbhísí tacaíochta ar fáil

source: Employees and employers may also find this series of short, simple information leaflets aimed at the bereaved and those who support them, of assistance
ga: B'fhéidir go mbeadh idir fhostóirí agus fhostaithe in ann leas a bhaint as an tsraith bhileoga gearra simplí seo atá dírithe ar lucht méala agus orthu siúd a thugann tacaíocht dóibh

source: If you are called for jury service, generally you are obliged to attend
ga: Má iarrtar ort seirbhís a dhéanamh ar ghiúiré, ní mór duit freastal air de ghnáth

source: The Juries Act 1976 requires that an employee or an apprentice who is called for jury service be given time off to attend the court
ga: Éilíonn Acht na nGiúiréithe 1976 go dtabharfaidh fostóir am saor d'fhostaí nó do phrintíseach le freastal ar an gcúirt má iarrtar ar an té sin seirbhís giúiré a dhéanamh

source: Under the Act while you are absent from work to comply with a jury summons you are entitled to be paid and you should not lose any other employment entitlements or rights
ga: Tá tú i dteideal pá a fháil, de réir an Achta, má tá tú as láthair ó obair le toghairm ghiúiré a shásamh agus ní cóir go gcaillfeá aon teidlíocht nó ceart fostaíochta dá bharr

source: So, for example, the time spent on jury service will not mean any loss of annual leave entitlement
ga: Ní chaillfidh tú puinn de do theidlíocht maidir le saoire bhliantúil, mar shampla, de bharr an ama a chaith tú ag freastal ar ghiúiré

source: Career break or study leave
ga: Sos gairme nó saoire staidéir

source: There is no entitlement to take unpaid leave such as a career break or study leave
ga: Níl aon teidlíocht ann maidir le sos gairme nó saoire staidéir a fháil

source: You may have a provision in your contract of employment about this or you may be able to negotiate with your employer
ga: B'fhéidir go bhfuil foráil fúthu i do chonradh fostaíochta nó b'fhéidir go bhféadfaidh tú dul i mbun caibidlíochta le d'fhostóir faoin scéal

source: An employer should consider requests for a career break or study leave made on an individual basis
ga: Ba chóir d'fhostóir gach iarratas ar shos gairme nó ar shaoire staidéar a bhreathnú ar a fhiúntas féin

source: Force majeure leave: you must notify your employer as soon as practicably possible that you need to avail of force majeure leave
ga: Saoire Force Majeure: Ní mór duit d'fhostóir a chur ar an eolas chomh luath agus is féidir go bhfuil ort saoire force majeure a ghlacadh

source: Immediately on your return to work, you must make your application in writing to your employer
ga: Chomh luath agus a fhilleann tú ar an obair, ní mór duit d'iarratas a dhéanamh i scríbhinn chuig d'fhostóir

source: Your application in writing should include your name, PPS number, name and address of your employer, date(s) on which you took force majeure leave and reasons why, and your relationship to the person who was injured or ill
ga: Ba chóir duit d'ainm, d'uimhir PSP, ainm agus seoladh d'fhostóir, an dáta (na dátaí) ar ar ghlac tú saoire force majeure agus na cúiseanna a bhí léi, agus an gaol a bhí agat leis an duine a bhí gortaithe nó tinn a scríobh síos i d'iarratas

source: Your contract of employment may require you to provide a medical certificate
ga: B'fhéidir go mbeidh ort teastas dochtúra a sholáthar de réir téarmaí do chonradh fostaíochta

source: As with parental leave, your employer must keep records of all force majeure leave taken by employees
ga: Ní mór do d'fhostóir taifead a dhéanamh de gach saoire force majeure a ghlacann fostaí faoi mar is gá a dhéanamh i gcás gach saoire tuismitheora

source: Further information about force majeure leave is available from Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Is féidir breis eolais faoi shaoire force majeure a fháil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: If there is a dispute between you and your employer about force majeure leave the issue can be referred within 6 months of the dispute occurring. You must use the online complaint form available on workplacerelations.ie)
ga: Má tá fadhb agat maidir le saoire force majeure a fháil féadfaidh tú gearán a dhéanamh tríd an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie. Ní mór duit gearán a dhéanamh laistigh de 6 mhí

source: The time limit may be extended for up to a further 6 months, but only where there is a reasonable cause which prevented the complaint being brought within the normal time limit. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama
